; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument5 infrared3)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite3 Phenomenon9)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared3)
	(have_image Planet10 image1)
))

)

; plan
1. (turn_to satellite3 groundstation4 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 6
3. (calibrate satellite3 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 0 of 6
4. (turn_to satellite3 planet10 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet10)
   goals met: 0 of 6
5. (take_image satellite3 planet10 instrument4 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 6
6. (turn_to satellite3 phenomenon7 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 6
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (take_image satellite3 phenomenon7 instrument4 image1)
   added: (have_image phenomenon7 image1)
   goals met: 2 of 6
10. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 6
11. (take_image satellite1 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 3 of 6
12. (turn_to satellite1 groundstation3 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation3)
   goals met: 4 of 6
13. (turn_to satellite3 planet8 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet8)
   goals met: 4 of 6
14. (take_image satellite3 planet8 instrument4 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 5 of 6
15. (turn_to satellite3 phenomenon9 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon9)
   goals met: 6 of 6
